In [2]:
persons = {
    'FName':['Mukesh','Admin','Raja','Willie','joe'],
    'LName':['Yadav', 'admin','Sastri','Meeks','knack'],
    'Occupation':['Engineer','Product Ownor','Architect','Infra Admin','Vendor mgmt'],
    'Location':['Jaipur', 'Delhi', 'Pink city','USA', 'Canada'],
    'PinCode':['303106', '302020', '302016','12321','344354'],
    'Hobby':['Reading', 'Study','playing','Hockey','Baseball']
             }

In [ ]:
persons

In [3]:
import pandas as pd

In [4]:
data = pd.DataFrame(persons)
data.head()

    FName   LName     Occupation   Location PinCode     Hobby
0  Mukesh   Yadav       Engineer     Jaipur  303106   Reading
1   Admin   admin  Product Ownor      Delhi  302020     Study
2    Raja  Sastri      Architect  Pink city  302016   playing
3  Willie   Meeks    Infra Admin        USA   12321    Hockey
4     joe   knack    Vendor mgmt     Canada  344354  Baseball

In [ ]:
# Before start altering columns and rows let's check the columns

data.columns

In [ ]:
#Let's be more specific and change the column names to some others

data.columns = ['First_Name','Last_Name','Persons_Job','Location', 'Pincode', 'Hobby']

In [ ]:
data.columns

In [7]:
# Now lets try to change the upper or lower columns name, use list comprehension

data.columns = [column.upper() for column in data.columns ]
data

    FNAME   LNAME     OCCUPATION   LOCATION PINCODE     HOBBY
0  Mukesh   Yadav       Engineer     Jaipur  303106   Reading
1   Admin   admin  Product Ownor      Delhi  302020     Study
2    Raja  Sastri      Architect  Pink city  302016   playing
3  Willie   Meeks    Infra Admin        USA   12321    Hockey
4     joe   knack    Vendor mgmt     Canada  344354  Baseball

In [ ]:
# Let's try to replace the space with _(underscore)


data.columns = data.columns.str.replace(' ', '_')
data

# Here there won't be any change because our data columns don't have any space like First Name

In [ ]:
data.columns = data.columns.str.replace('_', ' ')
data

In [ ]:
data.columns = data.columns.str.replace(' ', '_')
data

In [ ]:
# Now what if we want to change the column names to some specific columns only, let's use dictionary

data.rename(columns={'FIRST_NAME':'EmpFname', 'LAST_NAME':'EmpLname'})

In [ ]:
data

In [8]:
#But from the above output we can see that changes are not reflecting, so we need to do inplace=True
data.rename(columns={'FIRST_NAME':'EmpFname', 'LAST_NAME':'EmpLname'}, inplace=True)

In [ ]:
data

In [ ]:
# Now let's update the data in rows
# let's update the single row, we have couple of ways to do so

data.iloc[4]

In [ ]:
data.iloc[4]= ['JOE', 'K-nack','Vendor','Canada','123123','Horse Riding']
data

#Here you will get the error if not paas the entire rows data

In [ ]:
# Mention the column name against which row you want to update
data.iloc[4]['EmpFname'] = 'Anna'
#data.loc[4, []'EmpFname'] = 'Annaa'

In [ ]:
data

In [ ]:
# You can pass multiple columns to update the rows.
data.loc[3, ['LOCATION', 'PINCODE']] = ['United State', '001120']
data

In [ ]:
# We do have a different method to change to single specific value named as 'at'

In [ ]:
data.at[4, ['EmpFname','EmpLname']] = ['Annnaa','K-NACK']
data

In [ ]:
data.loc[2]

In [ ]:
# If you have large data set and you want to update some rows -
# Now lets update the row using some filter condition

filt = (data['HOBBY'] == 'playing')
data[filt]

In [ ]:
filt

In [ ]:
data[filt]['PINCODE']

In [ ]:
# Let's try to set the value

data[filt]['PINCODE']='302020'

In [ ]:
data.loc[filt, 'PINCODE']='302020'
data

In [ ]:
# So far we have seen single row update but what if you want to update multiple rows simultenously....

In [ ]:
data

### Using functions
   - apply
   - map
   - applymap
   - replace

### apply()
   - apply can work on a dataframes or on a series but behaviour could be different as you expect, let's see on series.

In [5]:
data

    FName   LName     Occupation   Location PinCode     Hobby
0  Mukesh   Yadav       Engineer     Jaipur  303106   Reading
1   Admin   admin  Product Ownor      Delhi  302020     Study
2    Raja  Sastri      Architect  Pink city  302016   playing
3  Willie   Meeks    Infra Admin        USA   12321    Hockey
4     joe   knack    Vendor mgmt     Canada  344354  Baseball

In [9]:
data['HOBBY'].apply(len)

0    7
1    5
2    7
3    6
4    8
Name: HOBBY, dtype: int64

In [ ]:
# let's create a function and use apply method to update the values

def update_hobby(hobby):
    return hobby.upper()

In [ ]:
data['HOBBY'].apply(update_hobby) # here we don't to execute the function so lets paas without parathensis

In [ ]:
#Instead of above function we can use lembda function, let's convert it back to lower case

data['HOBBY'].apply(lambda x : x.lower())

#### Now lets see how apply works on dataframes

In [ ]:
data['HOBBY'].apply(len)

In [ ]:
data.apply(len)

In [ ]:
# Here you can see that it's actually not applying length function to every value in the dataframe
#instead of that it's applying on series specifically to the columns
data

In [ ]:
# manually we can check the length of a series

len(data['EmpFname'])

In [ ]:
data.apply(len, axis='columns')

In [ ]:
data.apply(pd.Series.min)

In [ ]:
# we can use lambda function as well but remember that lambda works with series

data.apply(lambda x: x.min())

### applymap

In [ ]:
data['HOBBY'].applymap(len)

In [ ]:
data.applymap(len)

In [ ]:
data.applymap(str.lower)

### map()
- only works on a series

In [ ]:
data

In [ ]:
# Now let's try to substitute first name

data['EmpFname'].map({'Raja':'Ashish', 'Willie':'Shawn'})

In [ ]:
# Let's work on a larger data set to apply map 

df = pd.read_csv('developer_survey_2019/survey_results_public.csv')

In [ ]:
df.head()
# Here we can see that Hobbyist column has the values in Yes or No, so let's try to convert them to True or False

In [ ]:
df['Hobbyist'].map({'Yes':True, 'No': False}, inplace=True)
# so here all Yes and No will convert to the T/F but apart from Y/N will be set as NaN, so we can use replace

### replace()

In [ ]:
data['EmpFname'].replace({'Raja':'Ashish', 'Willie':'Shawn'})

In [ ]:
df['Hobbyist'].replace({'Yes':True, 'No': False}, inplace=True)